Show / Hide Table of Contents
Class LoadGroup
Load group
Inheritance
System.Object
OpenObject
OpenElementId
LoadGroup
LoadGroupEC
LoadGroupSIA
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Loading
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class LoadGroup : OpenElementId
Properties
Improve this Doc   View Source
Dzeta
ζ
Declaration
public double Dzeta { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
GammaGInf
γ G,Inf
Declaration
public double GammaGInf { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
GammaGSup
γ G,Sup
Declaration
public double GammaGSup { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
GammaQ
γ Q
Declaration
public double GammaQ { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
GroupType
Group type
Declaration
public LoadGroupType GroupType { get; set; }
Property Value
 Type |  Description
 LoadGroupType
Improve this Doc   View Source
Name
Name of load group
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Relation
Relation
Declaration
public Relation Relation { get; set; }
Property Value
 Type |  Description
 Relation
 Improve this Doc
 View Source